source/_static/diagrams/40-login-vs-partition.d2
direction: right
n0: "ReFrame host"
n1: "setup"
n2: "cleanup"
n3: "partition"
n4: "compile"
n5: "run"
n0 -> n1
n0 -> n2
n3 -> n4
n3 -> n5
